In [20]:
import pandas as pd
import numpy as np

In [21]:
df = pd.read_csv('./estudiantes.csv')
print(df)
# Este ejemplo ya lo convertimos desde el propio excel

     NOMBRE  EDAD GENERO      CARRERA  SEMESTRE
0      Luis    45      M     Auditoria  Primero
1     Luisa    42      F   Informatica  Primero
2       Leo    15      M       Derecho   Quinto
3   Marcela    35      F   Informatica  Septimo
4    Andres    24      M       Derecho  Tercero
5       Ana    65      F  Arquitectura  Septimo
6  Fernanda    12      F   Infromatica  Primero
7     David    45      M      Economia   Noveno

Pasamos de Excel a Csv

In [24]:
# Pasar de excel a csv
convertir = pd.read_excel('./estudiantes.xlsx')  # Leemos el archivo

In [25]:
# Pasamos el archivo a csv
convertir.to_csv('./estudiantesDos.csv', index=None, header=True)

Usamos el archivo convertido.

In [92]:
dfConvertido = pd.read_csv('./estudiantesDos.csv')
dfConvertido

     NOMBRE  EDAD GENERO       CARRERA SEMESTRE
0      Luis    45      M     Auditoria  Primero
1     Luisa    42      F   Informatica  Primero
2       Leo    15      M       Derecho   Quinto
3   Marcela    35      F   Informatica  Septimo
4    Andres    24      M       Derecho  Tercero
5       Ana    65      F  Arquitectura  Septimo
6  Fernanda    12      F   Infromatica  Primero
7     David    45      M      Economia   Noveno

In [93]:
# Usamos coordenadas de localizacion
dfConvertido.iloc[1,3]  # Filas y columnas
# Muestra el valor filtrado por columnas

'Informatica'

In [94]:
dfConvertido.iloc[2,3]  # Filtramos resultados con iloc

'Derecho'

In [95]:
dfConvertido.iloc[2, :3]  # Filtramos por fila, desde nombre edad hasta Genero con slincing

NOMBRE    Leo
EDAD       15
GENERO      M
Name: 2, dtype: object

NOTA: Siempre esta pendiente a los espacios

In [96]:
dfConvertido.loc[2, 'CARRERA']

'Derecho'

In [97]:
# Llamamos a dos nombres
dfConvertido.loc[:3, ('NOMBRE', 'CARRERA')]

    NOMBRE      CARRERA
0     Luis    Auditoria
1    Luisa  Informatica
2      Leo      Derecho
3  Marcela  Informatica

In [98]:
dfConvertido.iloc[1, :3]

NOMBRE    Luisa
EDAD         42
GENERO        F
Name: 1, dtype: object

Añadir columnas al dataFrame

In [99]:
dfConvertido['TURNO'] = pd.Series(['tarde', 'noche', 'tarde', 'noche', 'tarde', 'dia'])

In [100]:
dfConvertido  # aAparecerá turno

     NOMBRE  EDAD GENERO       CARRERA SEMESTRE  TURNO
0      Luis    45      M     Auditoria  Primero  tarde
1     Luisa    42      F   Informatica  Primero  noche
2       Leo    15      M       Derecho   Quinto  tarde
3   Marcela    35      F   Informatica  Septimo  noche
4    Andres    24      M       Derecho  Tercero  tarde
5       Ana    65      F  Arquitectura  Septimo    dia
6  Fernanda    12      F   Infromatica  Primero    NaN
7     David    45      M      Economia   Noveno    NaN

In [101]:
# Eliminar una serie
SEMESTRE = dfConvertido.pop('SEMESTRE')

In [103]:
dfConvertido

     NOMBRE  EDAD GENERO       CARRERA  TURNO
0      Luis    45      M     Auditoria  tarde
1     Luisa    42      F   Informatica  noche
2       Leo    15      M       Derecho  tarde
3   Marcela    35      F   Informatica  noche
4    Andres    24      M       Derecho  tarde
5       Ana    65      F  Arquitectura    dia
6  Fernanda    12      F   Infromatica    NaN
7     David    45      M      Economia    NaN

In [104]:
nuevaSerie = pd.Series(['Carlos', 27, 'M', 'Programacion', 'Tarde'], index=['NOMBRE', 'EDAD', 'GENERO', 'CARRERA', 'TURNO'])
dfConvertido = pd.concat([dfConvertido, nuevaSerie.to_frame().T], ignore_index=True)

In [105]:
dfConvertido

     NOMBRE EDAD GENERO       CARRERA  TURNO
0      Luis   45      M     Auditoria  tarde
1     Luisa   42      F   Informatica  noche
2       Leo   15      M       Derecho  tarde
3   Marcela   35      F   Informatica  noche
4    Andres   24      M       Derecho  tarde
5       Ana   65      F  Arquitectura    dia
6  Fernanda   12      F   Infromatica    NaN
7     David   45      M      Economia    NaN
8    Carlos   27      M  Programacion  Tarde

In [107]:
dfConvertido.drop([1, 2])  # Eliminamos la cofila 1 y dos

     NOMBRE EDAD GENERO       CARRERA  TURNO
0      Luis   45      M     Auditoria  tarde
3   Marcela   35      F   Informatica  noche
4    Andres   24      M       Derecho  tarde
5       Ana   65      F  Arquitectura    dia
6  Fernanda   12      F   Infromatica    NaN
7     David   45      M      Economia    NaN
8    Carlos   27      M  Programacion  Tarde

In [108]:
dfConvertido[(dfConvertido['GENERO'] == 'F') & (dfConvertido['EDAD'] >= 22)]

    NOMBRE EDAD GENERO       CARRERA  TURNO
1    Luisa   42      F   Informatica  noche
3  Marcela   35      F   Informatica  noche
5      Ana   65      F  Arquitectura    dia

In [109]:
dfConvertido

     NOMBRE EDAD GENERO       CARRERA  TURNO
0      Luis   45      M     Auditoria  tarde
1     Luisa   42      F   Informatica  noche
2       Leo   15      M       Derecho  tarde
3   Marcela   35      F   Informatica  noche
4    Andres   24      M       Derecho  tarde
5       Ana   65      F  Arquitectura    dia
6  Fernanda   12      F   Infromatica    NaN
7     David   45      M      Economia    NaN
8    Carlos   27      M  Programacion  Tarde

In [111]:
# Trabajamos atraves e los vcalores de forma numerica
dfConvertido.sort_values('CARRERA')

     NOMBRE EDAD GENERO       CARRERA  TURNO
5       Ana   65      F  Arquitectura    dia
0      Luis   45      M     Auditoria  tarde
2       Leo   15      M       Derecho  tarde
4    Andres   24      M       Derecho  tarde
7     David   45      M      Economia    NaN
1     Luisa   42      F   Informatica  noche
3   Marcela   35      F   Informatica  noche
6  Fernanda   12      F   Infromatica    NaN
8    Carlos   27      M  Programacion  Tarde

In [112]:
dfConvertido.sort_values('EDAD')

     NOMBRE EDAD GENERO       CARRERA  TURNO
6  Fernanda   12      F   Infromatica    NaN
2       Leo   15      M       Derecho  tarde
4    Andres   24      M       Derecho  tarde
8    Carlos   27      M  Programacion  Tarde
3   Marcela   35      F   Informatica  noche
1     Luisa   42      F   Informatica  noche
0      Luis   45      M     Auditoria  tarde
7     David   45      M      Economia    NaN
5       Ana   65      F  Arquitectura    dia

In [114]:
dfConvertido.dropna()  # Elimina las filas en donde hayan datos desconocidos

    NOMBRE EDAD GENERO       CARRERA  TURNO
0     Luis   45      M     Auditoria  tarde
1    Luisa   42      F   Informatica  noche
2      Leo   15      M       Derecho  tarde
3  Marcela   35      F   Informatica  noche
4   Andres   24      M       Derecho  tarde
5      Ana   65      F  Arquitectura    dia
8   Carlos   27      M  Programacion  Tarde